Revit 2027 API
BuiltInFailures.SketchFailures.AxisNotSpecified Property
 Axis of revolution not specified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AxisNotSpecified { get; }
Public Shared ReadOnly Property AxisNotSpecified As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AxisNotSpecified {
	FailureDefinitionId^ get ();
}
static member AxisNotSpecified : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace